app/controllers/books_controller.rb

  def index
    # @books = Book.all
    # @books = Book.all.includes(:id).order(created_at: :desc).page(params[:page])
    @books = Book.order(:id).page(params[:page]).per(2)
---
SELECT COUNT(*) FROM "books"